chronicle: much more docs.
